Revit 2027 API
View.HideActiveWorkPlane Method
Hide the active work plane of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideActiveWorkPlane()
Public Sub HideActiveWorkPlane
public:
void HideActiveWorkPlane()
member HideActiveWorkPlane : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace